; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v6 ?v9)
             (pred_1 ?v4 ?v13)
             (pred_6 ?v6 ?v13)
             (pred_10 ?v11 ?v6 )
	     (pred_3 ?v6)
             (pred_9 ?v8)
             (pred_4 ?v4)
             (pred_5 ?v13)
             (pred_11 ?v6)
             (pred_2 ?v4)
             (pred_7 ?v6)
             (pred_8 ))



(:action op_5
:parameters (?v3 ?v1 ?v7 ?v12)
:precondition (and (pred_9 ?v3) (pred_9 ?v1) (pred_4 ?v7) (pred_5 ?v12)
          (pred_12 ?v3 ?v1) (pred_1 ?v7 ?v12)
                   (pred_6 ?v1 ?v12) (pred_3 ?v3) 
                   (pred_11 ?v1) (pred_2 ?v7))
:effect (and  (pred_7 ?v1) (not (pred_11 ?v1))))


(:action op_4
:parameters (?v3 ?v10)
:precondition (and (pred_9 ?v3) (pred_9 ?v10)
               (pred_3 ?v3) (pred_12 ?v3 ?v10) (pred_7 ?v10))
:effect (and (pred_3 ?v10) (not (pred_3 ?v3))))

(:action op_3
:parameters (?v3 ?v7)
:precondition (and (pred_9 ?v3) (pred_4 ?v7) 
                  (pred_3 ?v3) (pred_10 ?v7 ?v3) (pred_8 ))
:effect (and (pred_2 ?v7)
   (not (pred_10 ?v7 ?v3)) (not (pred_8 ))))


(:action op_1
:parameters (?v3 ?v2 ?v5)
:precondition (and (pred_9 ?v3) (pred_4 ?v2) (pred_4 ?v5)
                  (pred_3 ?v3) (pred_2 ?v5) (pred_10 ?v2 ?v3))
:effect (and (pred_2 ?v2) (pred_10 ?v5 ?v3)
        (not (pred_2 ?v5)) (not (pred_10 ?v2 ?v3))))

(:action op_2
:parameters (?v3 ?v7)
:precondition (and (pred_9 ?v3) (pred_4 ?v7) 
                  (pred_3 ?v3) (pred_2 ?v7))
:effect (and (pred_8 ) (pred_10 ?v7 ?v3) (not (pred_2 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_21 obj_13 obj_15 obj_16 obj_29 obj_25 obj_08 obj_22 obj_10 obj_06 obj_14 obj_01 obj_23 obj_11 obj_04 obj_05 obj_03 obj_30 obj_07 obj_26 obj_02 obj_20 obj_18 obj_24
    obj_19 obj_27
    obj_17 obj_12 obj_28
    )

    (:init
       (pred_8)

       (pred_9 obj_09)
       (pred_9 obj_21)
       (pred_9 obj_13)
       (pred_9 obj_15)
       (pred_9 obj_16)
       (pred_9 obj_29)
       (pred_9 obj_25)
       (pred_9 obj_08)
       (pred_9 obj_22)
       (pred_9 obj_10)
       (pred_9 obj_06)
       (pred_9 obj_14)
       (pred_9 obj_01)
       (pred_9 obj_23)
       (pred_9 obj_11)
       (pred_9 obj_04)
       (pred_9 obj_05)
       (pred_9 obj_03)
       (pred_9 obj_30)
       (pred_9 obj_07)
       (pred_9 obj_26)
       (pred_9 obj_02)
       (pred_9 obj_20)
       (pred_9 obj_18)
       (pred_9 obj_24)
       (pred_5 obj_19)
       (pred_5 obj_27)
       (pred_4 obj_17)
       (pred_4 obj_12)
       (pred_4 obj_28)

       (pred_12 obj_09 obj_29)
       (pred_12 obj_09 obj_21)
       (pred_12 obj_21 obj_25)
       (pred_12 obj_21 obj_13)
       (pred_12 obj_21 obj_09)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_13 obj_21)
       (pred_12 obj_15 obj_22)
       (pred_12 obj_15 obj_16)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_16 obj_10)
       (pred_12 obj_16 obj_15)
       (pred_12 obj_29 obj_06)
       (pred_12 obj_29 obj_25)
       (pred_12 obj_29 obj_09)
       (pred_12 obj_25 obj_14)
       (pred_12 obj_25 obj_08)
       (pred_12 obj_25 obj_21)
       (pred_12 obj_25 obj_29)
       (pred_12 obj_08 obj_01)
       (pred_12 obj_08 obj_22)
       (pred_12 obj_08 obj_13)
       (pred_12 obj_08 obj_25)
       (pred_12 obj_22 obj_23)
       (pred_12 obj_22 obj_10)
       (pred_12 obj_22 obj_15)
       (pred_12 obj_22 obj_08)
       (pred_12 obj_10 obj_11)
       (pred_12 obj_10 obj_16)
       (pred_12 obj_10 obj_22)
       (pred_12 obj_06 obj_04)
       (pred_12 obj_06 obj_14)
       (pred_12 obj_06 obj_29)
       (pred_12 obj_14 obj_05)
       (pred_12 obj_14 obj_01)
       (pred_12 obj_14 obj_25)
       (pred_12 obj_14 obj_06)
       (pred_12 obj_01 obj_03)
       (pred_12 obj_01 obj_23)
       (pred_12 obj_01 obj_08)
       (pred_12 obj_01 obj_14)
       (pred_12 obj_23 obj_30)
       (pred_12 obj_23 obj_11)
       (pred_12 obj_23 obj_22)
       (pred_12 obj_23 obj_01)
       (pred_12 obj_11 obj_07)
       (pred_12 obj_11 obj_10)
       (pred_12 obj_11 obj_23)
       (pred_12 obj_04 obj_26)
       (pred_12 obj_04 obj_05)
       (pred_12 obj_04 obj_06)
       (pred_12 obj_05 obj_02)
       (pred_12 obj_05 obj_03)
       (pred_12 obj_05 obj_14)
       (pred_12 obj_05 obj_04)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_03 obj_30)
       (pred_12 obj_03 obj_01)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_30 obj_18)
       (pred_12 obj_30 obj_07)
       (pred_12 obj_30 obj_23)
       (pred_12 obj_30 obj_03)
       (pred_12 obj_07 obj_24)
       (pred_12 obj_07 obj_11)
       (pred_12 obj_07 obj_30)
       (pred_12 obj_26 obj_02)
       (pred_12 obj_26 obj_04)
       (pred_12 obj_02 obj_20)
       (pred_12 obj_02 obj_05)
       (pred_12 obj_02 obj_26)
       (pred_12 obj_20 obj_18)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_20 obj_02)
       (pred_12 obj_18 obj_24)
       (pred_12 obj_18 obj_30)
       (pred_12 obj_18 obj_20)
       (pred_12 obj_24 obj_07)
       (pred_12 obj_24 obj_18)
       (pred_11 obj_26)
       (pred_11 obj_20)
       (pred_11 obj_14)
       (pred_6  obj_26 obj_19)
       (pred_6  obj_20 obj_27)
       (pred_6  obj_14 obj_19)
       (pred_7 obj_09)
       (pred_7 obj_21)
       (pred_7 obj_13)
       (pred_7 obj_15)
       (pred_7 obj_16)
       (pred_7 obj_29)
       (pred_7 obj_25)
       (pred_7 obj_08)
       (pred_7 obj_22)
       (pred_7 obj_10)
       (pred_7 obj_06)
       (pred_7 obj_01)
       (pred_7 obj_23)
       (pred_7 obj_11)
       (pred_7 obj_04)
       (pred_7 obj_05)
       (pred_7 obj_03)
       (pred_7 obj_30)
       (pred_7 obj_07)
       (pred_7 obj_02)
       (pred_7 obj_18)
       (pred_7 obj_24)

       (pred_1  obj_17 obj_19)
       (pred_1  obj_12 obj_27)
       (pred_1  obj_28 obj_19)
       (pred_10 obj_17 obj_15)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_28 obj_03)
       (pred_3 obj_21)
    )

    (:goal (and
       (pred_10 obj_28 obj_04)
    ))
(:constraints
  (always (not (pred_3 obj_05)))
)
)

; plan
1. (op_4 obj_21 obj_25)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_25)
   goals met: 0 of 1
2. (op_4 obj_25 obj_08)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_08)
   goals met: 0 of 1
3. (op_4 obj_08 obj_01)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_01)
   goals met: 0 of 1
4. (op_4 obj_01 obj_03)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_03)
   goals met: 0 of 1
5. (op_3 obj_03 obj_28)
   deleted: (pred_10 obj_28 obj_03) (pred_8)
   added: (pred_2 obj_28)
   goals met: 0 of 1
6. (op_4 obj_03 obj_01)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_01)
   goals met: 0 of 1
7. (op_5 obj_01 obj_14 obj_28 obj_19)
   deleted: (pred_11 obj_14)
   added: (pred_7 obj_14)
   goals met: 0 of 1
8. (op_4 obj_01 obj_14)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_14)
   goals met: 0 of 1
9. (op_4 obj_14 obj_06)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_06)
   goals met: 0 of 1
10. (op_4 obj_06 obj_04)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_04)
   goals met: 0 of 1
11. (op_2 obj_04 obj_28)
   deleted: (pred_2 obj_28)
   added: (pred_8) (pred_10 obj_28 obj_04)
   goals met: 1 of 1
